[
  { "id": "11111111-1111-1111-1111-111111111111", "title": "Complete Web Development Bootcamp", "description": "Learn HTML, CSS, JavaScript, React, Node.js, and MongoDB from scratch. Build real-world projects and become a full-stack developer." },
  { "id": "22222222-2222-2222-2222-222222222222", "title": "Python for Data Science and Machine Learning", "description": "Master Python programming, data analysis with Pandas, machine learning with scikit-learn, and data visualization. Includes hands-on projects." },
  { "id": "33333333-3333-3333-3333-333333333333", "title": "Advanced React and Redux Development", "description": "Deep dive into React Hooks, Redux state management, performance optimization, testing, and building production-ready applications." },
  { "id": "44444444-4444-4444-4444-444444444444", "title": "Mobile App Development with Flutter", "description": "Build beautiful native mobile applications for iOS and Android using Flutter and Dart. Learn state management, APIs, and deployment." },
  { "id": "55555555-5555-5555-5555-555555555555", "title": "DevOps Engineering: Docker, Kubernetes, CI/CD", "description": "Master containerization with Docker, orchestration with Kubernetes, CI/CD pipelines, and infrastructure as code. Real-world DevOps projects." },
  { "id": "66666666-6666-6666-6666-666666666666", "title": "UI/UX Design Masterclass", "description": "Learn user experience design, Figma, prototyping, user research, design systems, and create stunning interfaces. Portfolio projects included." },
  { "id": "77777777-7777-7777-7777-777777777777", "title": "Cloud Computing with AWS", "description": "Comprehensive AWS course covering EC2, S3, Lambda, RDS, VPC, and more. Prepare for AWS Solutions Architect certification." },
  { "id": "88888888-8888-8888-8888-888888888888", "title": "Cybersecurity Fundamentals", "description": "Learn network security, ethical hacking, penetration testing, cryptography, and security best practices. Hands-on labs included." },
  { "id": "99999999-9999-9999-9999-999999999999", "title": "Digital Marketing Complete Course", "description": "Master SEO, social media marketing, content marketing, email campaigns, Google Ads, and analytics. Grow your business online." },
  { "id": "aaaaaaaa-aaaa-aaaa-aaaa-aaaaaaaaaaaa", "title": "Blockchain Development with Solidity", "description": "Build decentralized applications, smart contracts, DeFi protocols, and NFT marketplaces on Ethereum blockchain." },
  { "id": "bbbbbbbb-bbbb-bbbb-bbbb-bbbbbbbbbbbb", "title": "Game Development with Unity", "description": "Create 2D and 3D games using Unity engine and C#. Learn game physics, AI, animations, and publish to multiple platforms." },
  { "id": "cccccccc-cccc-cccc-cccc-cccccccccccc", "title": "iOS App Development with Swift", "description": "Build native iOS applications using Swift, SwiftUI, UIKit, Core Data, and publish to the App Store. Real projects included." },
  { "id": "dddddddd-dddd-dddd-dddd-dddddddddddd", "title": "SQL and Database Design", "description": "Master SQL queries, database normalization, indexing, stored procedures, and design scalable database systems." },
  { "id": "eeeeeeee-eeee-eeee-eeee-eeeeeeeeeeee", "title": "Artificial Intelligence and Deep Learning", "description": "Learn neural networks, CNNs, RNNs, transformers, and build AI applications with TensorFlow and PyTorch. Cutting-edge projects." },
  { "id": "ffffffff-ffff-ffff-ffff-ffffffffffff", "title": "Project Management Professional (PMP)", "description": "Prepare for PMP certification exam. Learn project planning, risk management, Agile, Scrum, and lead successful projects." },
  { "id": "12345678-1234-1234-1234-123456789abc", "title": "Financial Analysis and Investment", "description": "Learn financial modeling, valuation techniques, portfolio management, investment strategies, and Excel for finance." },
  { "id": "23456789-2345-2345-2345-23456789abcd", "title": "English Speaking and Communication", "description": "Improve English fluency, pronunciation, business communication, presentation skills, and interview preparation." },
  { "id": "34567890-3456-3456-3456-3456789abcde", "title": "Photography Masterclass", "description": "Master camera settings, composition, lighting, portrait photography, landscape photography, and photo editing with Lightroom and Photoshop." }
]
